"Volume" = "Äänenvoimakkuus"; 
"Tuning" = "Viritys"; 
"Harmonics" = "Harmoninen taso"; 
"Timbre" = "Sointi"; 
"Timbre Envelope" = "Sointialue"; 
"Decay" = "Vaimennus"; 
"Richness" = "Runsaus"; 
"Distortion" = "Särö"; 